Meshes & Solutions/polygon-8/system/blockMeshDict
// File generated on 04-28-2024

// # Sides: 8
// Diameter: 1
// Foreground: 4
// Wake: 10
// Width: 4
// Height: 0.1
// Resolution: 10

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
                   
convertToMeters 1;

vertices
(
		 ( 18                  2.353553390593274   0.05  ) // 0  
		 ( 6.353553390593274   2.353553390593274   0.05  ) // 1  
		 ( 6.5                 2.0                 0.05  ) // 2  
		 ( 18                  2.0                 0.05  ) // 3  
		 ( 6.0                 4                   0.05  ) // 4  
		 ( 6.0                 2.5                 0.05  ) // 5  
		 ( 6.353553390593274   4                   0.05  ) // 6  
		 ( 5.646446609406726   4                   0.05  ) // 7  
		 ( 5.646446609406726   2.353553390593274   0.05  ) // 8  
		 ( 0                   2.0                 0.05  ) // 9  
		 ( 5.5                 2.0                 0.05  ) // 10 
		 ( 0                   2.353553390593274   0.05  ) // 11 
		 ( 0                   1.6464466094067263  0.05  ) // 12 
		 ( 5.646446609406726   1.6464466094067263  0.05  ) // 13 
		 ( 6.0                 0                   0.05  ) // 14 
		 ( 6.0                 1.5                 0.05  ) // 15 
		 ( 5.646446609406726   0                   0.05  ) // 16 
		 ( 6.353553390593274   0                   0.05  ) // 17 
		 ( 6.353553390593274   1.646446609406726   0.05  ) // 18 
		 ( 18                  1.646446609406726   0.05  ) // 19 
		 ( 0                   0                   0.05  ) // 20 
		 ( 0                   4                   0.05  ) // 21 
		 ( 18                  0                   0.05  ) // 22 
		 ( 18                  4                   0.05  ) // 23 
		 ( 18                  2.353553390593274   -0.05 ) // 24 
		 ( 6.353553390593274   2.353553390593274   -0.05 ) // 25 
		 ( 6.5                 2.0                 -0.05 ) // 26 
		 ( 18                  2.0                 -0.05 ) // 27 
		 ( 6.0                 4                   -0.05 ) // 28 
		 ( 6.0                 2.5                 -0.05 ) // 29 
		 ( 6.353553390593274   4                   -0.05 ) // 30 
		 ( 5.646446609406726   4                   -0.05 ) // 31 
		 ( 5.646446609406726   2.353553390593274   -0.05 ) // 32 
		 ( 0                   2.0                 -0.05 ) // 33 
		 ( 5.5                 2.0                 -0.05 ) // 34 
		 ( 0                   2.353553390593274   -0.05 ) // 35 
		 ( 0                   1.6464466094067263  -0.05 ) // 36 
		 ( 5.646446609406726   1.6464466094067263  -0.05 ) // 37 
		 ( 6.0                 0                   -0.05 ) // 38 
		 ( 6.0                 1.5                 -0.05 ) // 39 
		 ( 5.646446609406726   0                   -0.05 ) // 40 
		 ( 6.353553390593274   0                   -0.05 ) // 41 
		 ( 6.353553390593274   1.646446609406726   -0.05 ) // 42 
		 ( 18                  1.646446609406726   -0.05 ) // 43 
		 ( 0                   0                   -0.05 ) // 44 
		 ( 0                   4                   -0.05 ) // 45 
		 ( 18                  0                   -0.05 ) // 46 
		 ( 18                  4                   -0.05 ) // 47 
);

blocks
(
		hex (24  25  26  27  0   1   2   3  ) (100 10 1) simpleGrading (1 1 1) // 0

		hex (28  29  25  30  4   5   1   6  ) (20 10 1) simpleGrading (1 1 1) // 1
		hex (31  32  29  28  7   8   5   4  ) (20 10 1) simpleGrading (1 1 1) // 2

		hex (33  34  32  35  9   10  8   11 ) (20 10 1) simpleGrading (1 1 1) // 3
		hex (36  37  34  33  12  13  10  9  ) (20 10 1) simpleGrading (1 1 1) // 4

		hex (38  39  37  40  14  15  13  16 ) (20 10 1) simpleGrading (1 1 1) // 5
		hex (41  42  39  38  17  18  15  14 ) (20 10 1) simpleGrading (1 1 1) // 6

		hex (27  26  42  43  3   2   18  19 ) (100 10 1) simpleGrading (1 1 1) // 7

		hex (44  40  37  36  20  16  13  12 ) (20 20 1) simpleGrading (1 1 1) // 8
		hex (35  32  31  45  11  8   7   21 ) (20 20 1) simpleGrading (1 1 1) // 9
		hex (43  42  41  46  19  18  17  22 ) (100 20 1) simpleGrading (1 1 1) // 10
		hex (47  30  25  24  23  6   1   0  ) (100 20 1) simpleGrading (1 1 1) // 11
);

edges
(
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(35  11  9   33 )
			(33  9   12  36 )
			(44  20  12  36 )
			(35  11  21  45 )
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(27  3   0   24 )
			(43  19  3   27 )
			(43  19  22  46 )
			(47  23  0   24 )
		);
	}

	polygon
	{
		type wall;
		faces
		(
			(26  2   1   25 )
			(29  5   1   25 )
			(32  8   5   29 )
			(34  10  8   32 )
			(37  13  10  34 )
			(39  15  13  37 )
			(42  18  15  39 )
			(42  18  2   26 )
		);
	}

	top
	{
		type symmetryPlane;
		faces
		(
			(0   1   2   3  )
			(4   5   1   6  )
			(7   8   5   4  )
			(9   10  8   11 )
			(12  13  10  9  )
			(14  15  13  16 )
			(17  18  15  14 )
			(3   2   18  19 )
			(20  16  13  12 )
			(11  8   7   21 )
			(19  18  17  22 )
			(23  6   1   0  )
		);
	}

	bottom
	{
		type symmetryPlane;
		faces
		(
			(24  25  26  27 )
			(28  29  25  30 )
			(31  32  29  28 )
			(33  34  32  35 )
			(36  37  34  33 )
			(38  39  37  40 )
			(41  42  39  38 )
			(27  26  42  43 )
			(44  40  37  36 )
			(35  32  31  45 )
			(43  42  41  46 )
			(47  30  25  24 )
		);
	}

	outside
	{
		type patch;
		faces
		(
			(30  6   4   28 )
			(28  4   7   31 )
			(40  16  14  38 )
			(38  14  17  41 )
			(40  16  20  44 )
			(45  21  7   31 )
			(46  22  17  41 )
			(30  6   23  47 )
		);
	}

);

mergePatchPairs
(
);

