Meshes & Solutions/polygon-8/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       15760;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       15820;
    }
    polygon
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       15880;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          8000;
        startFace       15960;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          8000;
        startFace       23960;
    }
    outside
    {
        type            patch;
        nFaces          280;
        startFace       31960;
    }
)

// ************************************************************************* //
